database/app/Controllers/Buku.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $bukuModel = new BukuModel();
        $data['books'] = $bukuModel->findAll();
---
SELECT *
FROM `books`