database/app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userModel = new \App\Models\UserModel();
        $bukuModel = new \App\Models\BukuModel();
        $pinjamModel = new \App\Models\PeminjamanModel();

        $data['user'] = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'