database/app/Controllers/Peminjaman.php

SELECT COUNT(*) AS `numrows`
FROM `loans`
SELECT `loans`.*, `books`.`title`, `users`.`name` as `user_name`
FROM `loans`
JOIN `books` ON `books`.`id` = `loans`.`book_id`
JOIN `users` ON `users`.`id` = `loans`.`user_id`
ORDER BY `loans`.`tanggal_pinjam` DESC
 LIMIT 10
---
    public function semua()
    {
        if (!session()->get('logged_in') || session()->get('role') != 'admin') {
            return redirect()->to('/dashboard');
        }

        $start = $this->request->getGet('start');
        $end   = $this->request->getGet('end');
        $search = $this->request->getGet('q');

        $db = \Config\Database::connect();
        $builder = $db->table('loans');
        $builder->select('loans.*, books.title, users.name as user_name');
        $builder->join('books', 'books.id = loans.book_id');
        $builder->join('users', 'users.id = loans.user_id');

        if ($start && $end) {
            $builder->where('tanggal_pinjam >=', $start);
            $builder->where('tanggal_pinjam <=', $end);
        }

        if ($search) {
            $builder->groupStart()
                    ->like('books.title', $search)
                    ->orLike('users.name', $search)
                    ->groupEnd();
        }

        $builder->orderBy('loans.tanggal_pinjam', 'DESC');

        $data['peminjaman'] = $builder->get(10, ($this->request->getGet('page') ?? 1) * 10 - 10)->getResultArray();