database/app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/dashboard');

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();